# **Filter Dataframe with AND & OR operators**

---

In [0]:
import pandas as pd

In [2]:
from google.colab import files
upload = files.upload()

Saving employees.csv to employees.csv

In [0]:
df = pd.read_csv('employees.csv', parse_dates = ['Start Date', 'Last Login Time'])

In [0]:
df['Senior Management'] = df['Senior Management'].astype('bool')

In [0]:
df['Gender'] = df['Gender'].astype('category')

In [6]:
df.head()

  First Name  Gender Start Date  ... Bonus %  Senior Management             Team
0    Douglas    Male 1993-08-06  ...   6.945               True        Marketing
1     Thomas    Male 1996-03-31  ...   4.170               True              NaN
2      Maria  Female 1993-04-23  ...  11.858              False          Finance
3      Jerry    Male 2005-03-04  ...   9.340               True          Finance
4      Larry    Male 1998-01-24  ...   1.389               True  Client Services

[5 rows x 8 columns]

In [0]:
mask1 = df['Gender'] == 'Male'

In [0]:
mask2 = df['Team'] == 'Marketing'

In [10]:
df[mask1 & mask2].head()

   First Name Gender Start Date  ... Bonus %  Senior Management       Team
0     Douglas   Male 1993-08-06  ...   6.945               True  Marketing
21    Matthew   Male 1995-09-05  ...  13.645              False  Marketing
26      Craig   Male 2000-02-27  ...   7.757               True  Marketing
74     Thomas   Male 1995-06-04  ...  17.029              False  Marketing
77    Charles   Male 2004-09-14  ...   1.260               True  Marketing

[5 rows x 8 columns]

In [0]:
mask3 = df['Senior Management']

In [0]:
mask4 = df['Start Date'] < '1990-01-01'

In [13]:
df[mask3 | mask4].head()

  First Name Gender Start Date  ... Bonus %  Senior Management             Team
0    Douglas   Male 1993-08-06  ...   6.945               True        Marketing
1     Thomas   Male 1996-03-31  ...   4.170               True              NaN
3      Jerry   Male 2005-03-04  ...   9.340               True          Finance
4      Larry   Male 1998-01-24  ...   1.389               True  Client Services
5     Dennis   Male 1987-04-18  ...  10.125              False            Legal

[5 rows x 8 columns]

In [0]:
mask5 = df['First Name'] == 'Robert'

In [0]:
mask6 = df['Team'] == 'Client Services'

In [0]:
mask7 = df['Start Date']> '2016-06-01'

In [17]:
df[(mask5 & mask6) | mask7]

    First Name  Gender Start Date  ... Bonus %  Senior Management             Team
15     Lillian  Female 2016-06-05  ...   1.256              False          Product
98        Tina  Female 2016-06-16  ...  16.961               True        Marketing
387     Robert    Male 1994-10-29  ...  19.894              False  Client Services
451      Terry     NaN 2016-07-15  ...  19.490               True        Marketing

[4 rows x 8 columns]